ios-adp.org
#+TITLE: iOS 的「高级数据保护」
#+DATE: <2022-12-15 Thu 21:43>
* 2023
[2023-01-30 Mon 23:35]

关闭了 iOS 的「高级数据保护」，重新回到了 Cryptomator 和 Disk Decipher，同时开了后者的 NTFS write support 便于扩容 VeraCrypt Volume。不是因为「高级数据保护」不好用，而是因为我的 MacBook 已经无法升级到 macOS 13.1 了，我之前以为有 NAS 和「坚果云」这对我不会有什么影响，现在看也不需要预测了，事实证明库克即将赢麻了。🐶

* 2022
[2022-12-15 Thu 21:43]

刚启用了 iOS 16.2 RC 版本的「高级数据保护」。想到 Passkeys 也来了，再加上大家近来对手机隐私的重视。我预测库克很快就要赢麻了。 