ios-adp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>iOS 的「高级数据保护」</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jason Tian" />
<link rel="stylesheet" type="text/css" href="./css/worg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">iOS 的「高级数据保护」</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">2023</a></li>
<li><a href="#sec-2">2022</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">2023</h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-01-30 Mon 23:35]</span></span>
</p>

<p>
关闭了 iOS 的「高级数据保护」，重新回到了 Cryptomator 和 Disk Decipher，同时开了后者的 NTFS write support 便于扩容 VeraCrypt Volume。不是因为「高级数据保护」不好用，而是因为我的 MacBook 已经无法升级到 macOS 13.1 了，我之前以为有 NAS 和「坚果云」这对我不会有什么影响，现在看也不需要预测了，事实证明库克即将赢麻了。🐶
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">2022</h2>
<div class="outline-text-2" id="text-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-12-15 Thu 21:43]</span></span>
</p>

<p>
刚启用了 iOS 16.2 RC 版本的「高级数据保护」。想到 Passkeys 也来了，再加上大家近来对手机隐私的重视。我预测库克很快就要赢麻了。 </p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr />
<p><a href="//jsntn.com">Jason Tian</a><br /><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-12-15 Thu 21:43&gt;</span></span></p>
</div>
</body>
</html>
